load-test/results/medium-load-test.txt
Loading profile: medium (.\.env.medium)
BASE_URL=https://api.84.247.133.45.nip.io  VUs=120  Users=200  Sustain=5m

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: .\gomin-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 160 max VUs, 11m0s max duration (incl. graceful stop):
              * gomin: Up to 160 looping VUs for 10m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

INFO[0000] [setup] Registering 200 users…                source=console
INFO[0051] [setup] Registered 200/200                    source=console
INFO[0051] [setup] Logging in 200 users (token cache)…   source=console
INFO[0102] [setup] Cached tokens for 200/200 users       source=console
INFO[0102] [setup] Creating 7 group chats…               source=console
INFO[0102]   chat[1] 4a3c489f-252b-4e18-81b3-b0d432e82217 — 39 members  source=console
INFO[0103]   chat[2] b09719ac-14a7-49db-82a4-66a04d9530df — 35 members  source=console
INFO[0103]   chat[3] a14df068-4360-4bb7-acc7-04b1d11ac592 — 38 members  source=console
INFO[0103]   chat[4] 6f759468-a3b2-4f51-a7f2-2133e2bf62a9 — 36 members  source=console
INFO[0103]   chat[5] 448a0d6e-8e8b-4099-a1d2-6a95a23797d8 — 38 members  source=console
INFO[0104]   chat[6] 93c64ab7-3ad8-4509-bb9e-2c4106f665f9 — 35 members  source=console
INFO[0104]   chat[7] f5ed8a02-0afa-4aed-a43b-15d0e88dabbc — 36 members  source=console
INFO[0104] [setup] Done — 200 users, 7 chats, ready      source=console


  █ THRESHOLDS

    gomin_auth_error_rate
    ✓ 'rate<0.10' rate=0.00%

    gomin_messages_failed
    ✗ 'count<100' count=153

    http_req_duration
    ✗ 'p(95)<2000' p(95)=2.81s

    http_req_failed
    ✓ 'rate<0.05' rate=0.85%


  █ TOTAL RESULTS

    checks_total.......: 35970  48.152613/s
    checks_succeeded...: 99.10% 35649 out of 35970
    checks_failed......: 0.89%  321 out of 35970

    ✓ register 201
    ✓ create chat 201
    ✗ get chats 200
      ↳  98% — ✓ 4453 / ✗ 58
    ✗ get messages 200
      ↳  98% — ✓ 4452 / ✗ 59
    ✗ message 201
      ↳  99% — ✓ 22077 / ✗ 153
    ✗ ws handshake 101
      ↳  98% — ✓ 4460 / ✗ 51

    CUSTOM
    gomin_auth_error_rate..........: 0.00%  0 out of 200
    gomin_message_send_ms..........: avg=1.75s    min=45ms     med=1.77s    max=3.72s  p(90)=2.74s    p(95)=2.88s
    gomin_messages_failed..........: 153    0.204819/s
    gomin_messages_sent............: 22077  29.554218/s
    gomin_ws_connected.............: 4460   5.970549/s

    HTTP
    http_req_duration..............: avg=1.54s    min=45.31ms  med=1.58s    max=3.72s  p(90)=2.66s    p(95)=2.81s
      { expected_response:true }...: avg=1.55s    min=64.77ms  med=1.59s    max=3.72s  p(90)=2.66s    p(95)=2.81s
    http_req_failed................: 0.85%  270 out of 31659
    http_reqs......................: 31659  42.381528/s

    EXECUTION
    iteration_duration.............: avg=16.09s   min=1.24s    med=15.41s   max=21.22s p(90)=19.83s   p(95)=20.05s
    iterations.....................: 4511   6.038822/s
    vus............................: 1      min=0            max=160
    vus_max........................: 160    min=160          max=160

    NETWORK
    data_received..................: 1.0 GB 1.4 MB/s
    data_sent......................: 22 MB  30 kB/s

    WEBSOCKET
    ws_connecting..................: avg=170.35ms min=140.1ms  med=158.41ms max=2.7s   p(90)=194.37ms p(95)=219.19ms
    ws_msgs_received...............: 640895 857.958544/s
    ws_msgs_sent...................: 57840  77.429723/s
    ws_session_duration............: avg=12.93s   min=146.79ms med=12.18s   max=16.82s p(90)=15.7s    p(95)=15.99s
    ws_sessions....................: 4511   6.038822/s



                                                                                                                                                                                                                    
running (12m27.0s), 000/160 VUs, 4511 complete and 0 interrupted iterations                                                                                                                                         
gomin ✓ [======================================] 000/160 VUs  10m30s